#1. Считать строку набора чисел из файла. Напишите программу, которая покажет большее и меньшее число. 
#В качестве символа-разделителя используйте пробел. Результат запишите в исодный файл (minn maxx).

# f_path = 'test.txt'

# with open(f_path, 'r') as f_nums:
#     list_nums = f_nums.read().split(' ')
# # print(list_nums)
# for i in range(len(list_nums)):
#     list_nums[i] = int(list_nums[i])

# minmax_list = [min(list_nums), max(list_nums)]

# with open(f_path, 'a') as min_max:
#     min_max.writelines(f"\n {minmax_list} ")



# 2. Найдите корни квадратного уравнения Ax² + Bx + C = 0 двумя способами:
    
#     1) с помощью математических формул нахождения корней квадратного уравнения
#     2) с помощью дополнительных библиотек Python (scipy)

print('Ax² + Bx + C = 0')







    
# 3. Задайте два числа. Напишите программу, которая найдёт НОК (наименьшее общее кратное) этих двух чисел.
